GopalSaraf/Practicals/PSDL/include/proc/pic16f1704.inc
// Register: COG1BLKR
#define COG1BLKR COG1BLKR
COG1BLKR                                 equ 0693h
// bitfield definitions
COG1BLKR_G1BLKR_POSN                     equ 0000h
COG1BLKR_G1BLKR_POSITION                 equ 0000h
COG1BLKR_G1BLKR_SIZE                     equ 0006h
COG1BLKR_G1BLKR_LENGTH                   equ 0006h
COG1BLKR_G1BLKR_MASK                     equ 003Fh
COG1BLKR_G1BLKR0_POSN                    equ 0000h
COG1BLKR_G1BLKR0_POSITION                equ 0000h
COG1BLKR_G1BLKR0_SIZE                    equ 0001h
COG1BLKR_G1BLKR0_LENGTH                  equ 0001h
COG1BLKR_G1BLKR0_MASK                    equ 0001h
COG1BLKR_G1BLKR1_POSN                    equ 0001h
COG1BLKR_G1BLKR1_POSITION                equ 0001h
COG1BLKR_G1BLKR1_SIZE                    equ 0001h
COG1BLKR_G1BLKR1_LENGTH                  equ 0001h
COG1BLKR_G1BLKR1_MASK                    equ 0002h
COG1BLKR_G1BLKR2_POSN                    equ 0002h
COG1BLKR_G1BLKR2_POSITION                equ 0002h
COG1BLKR_G1BLKR2_SIZE                    equ 0001h
COG1BLKR_G1BLKR2_LENGTH                  equ 0001h
COG1BLKR_G1BLKR2_MASK                    equ 0004h
COG1BLKR_G1BLKR3_POSN                    equ 0003h
COG1BLKR_G1BLKR3_POSITION                equ 0003h
COG1BLKR_G1BLKR3_SIZE                    equ 0001h
COG1BLKR_G1BLKR3_LENGTH                  equ 0001h
COG1BLKR_G1BLKR3_MASK                    equ 0008h
COG1BLKR_G1BLKR4_POSN                    equ 0004h
COG1BLKR_G1BLKR4_POSITION                equ 0004h
COG1BLKR_G1BLKR4_SIZE                    equ 0001h
COG1BLKR_G1BLKR4_LENGTH                  equ 0001h
COG1BLKR_G1BLKR4_MASK                    equ 0010h
COG1BLKR_G1BLKR5_POSN                    equ 0005h
COG1BLKR_G1BLKR5_POSITION                equ 0005h
COG1BLKR_G1BLKR5_SIZE                    equ 0001h
COG1BLKR_G1BLKR5_LENGTH                  equ 0001h
COG1BLKR_G1BLKR5_MASK                    equ 0020h

// Register: COG1BLKF
#define COG1BLKF COG1BLKF
COG1BLKF                                 equ 0694h
// bitfield definitions
COG1BLKF_G1BLKF_POSN                     equ 0000h
COG1BLKF_G1BLKF_POSITION                 equ 0000h
COG1BLKF_G1BLKF_SIZE                     equ 0006h
COG1BLKF_G1BLKF_LENGTH                   equ 0006h
COG1BLKF_G1BLKF_MASK                     equ 003Fh
COG1BLKF_G1BLKF0_POSN                    equ 0000h
COG1BLKF_G1BLKF0_POSITION                equ 0000h
COG1BLKF_G1BLKF0_SIZE                    equ 0001h
COG1BLKF_G1BLKF0_LENGTH                  equ 0001h
COG1BLKF_G1BLKF0_MASK                    equ 0001h
COG1BLKF_G1BLKF1_POSN                    equ 0001h
COG1BLKF_G1BLKF1_POSITION                equ 0001h
COG1BLKF_G1BLKF1_SIZE                    equ 0001h
COG1BLKF_G1BLKF1_LENGTH                  equ 0001h
COG1BLKF_G1BLKF1_MASK                    equ 0002h
COG1BLKF_G1BLKF2_POSN                    equ 0002h
COG1BLKF_G1BLKF2_POSITION                equ 0002h
COG1BLKF_G1BLKF2_SIZE                    equ 0001h
COG1BLKF_G1BLKF2_LENGTH                  equ 0001h
COG1BLKF_G1BLKF2_MASK                    equ 0004h
COG1BLKF_G1BLKF3_POSN                    equ 0003h
COG1BLKF_G1BLKF3_POSITION                equ 0003h
COG1BLKF_G1BLKF3_SIZE                    equ 0001h
COG1BLKF_G1BLKF3_LENGTH                  equ 0001h
COG1BLKF_G1BLKF3_MASK                    equ 0008h
COG1BLKF_G1BLKF4_POSN                    equ 0004h
COG1BLKF_G1BLKF4_POSITION                equ 0004h
COG1BLKF_G1BLKF4_SIZE                    equ 0001h
COG1BLKF_G1BLKF4_LENGTH                  equ 0001h
COG1BLKF_G1BLKF4_MASK                    equ 0010h
COG1BLKF_G1BLKF5_POSN                    equ 0005h
COG1BLKF_G1BLKF5_POSITION                equ 0005h
COG1BLKF_G1BLKF5_SIZE                    equ 0001h
COG1BLKF_G1BLKF5_LENGTH                  equ 0001h
COG1BLKF_G1BLKF5_MASK                    equ 0020h

// Register: COG1DBR
#define COG1DBR COG1DBR
COG1DBR                                  equ 0695h
// bitfield definitions
COG1DBR_G1DBR_POSN                       equ 0000h
COG1DBR_G1DBR_POSITION                   equ 0000h
COG1DBR_G1DBR_SIZE                       equ 0006h
COG1DBR_G1DBR_LENGTH                     equ 0006h
COG1DBR_G1DBR_MASK                       equ 003Fh
COG1DBR_G1DBR0_POSN                      equ 0000h
COG1DBR_G1DBR0_POSITION                  equ 0000h
COG1DBR_G1DBR0_SIZE                      equ 0001h
COG1DBR_G1DBR0_LENGTH                    equ 0001h
COG1DBR_G1DBR0_MASK                      equ 0001h
COG1DBR_G1DBR1_POSN                      equ 0001h
COG1DBR_G1DBR1_POSITION                  equ 0001h
COG1DBR_G1DBR1_SIZE                      equ 0001h
COG1DBR_G1DBR1_LENGTH                    equ 0001h
COG1DBR_G1DBR1_MASK                      equ 0002h
COG1DBR_G1DBR2_POSN                      equ 0002h
COG1DBR_G1DBR2_POSITION                  equ 0002h
COG1DBR_G1DBR2_SIZE                      equ 0001h
COG1DBR_G1DBR2_LENGTH                    equ 0001h
COG1DBR_G1DBR2_MASK                      equ 0004h
COG1DBR_G1DBR3_POSN                      equ 0003h
COG1DBR_G1DBR3_POSITION                  equ 0003h
COG1DBR_G1DBR3_SIZE                      equ 0001h
COG1DBR_G1DBR3_LENGTH                    equ 0001h
COG1DBR_G1DBR3_MASK                      equ 0008h
COG1DBR_G1DBR4_POSN                      equ 0004h
COG1DBR_G1DBR4_POSITION                  equ 0004h
COG1DBR_G1DBR4_SIZE                      equ 0001h
COG1DBR_G1DBR4_LENGTH                    equ 0001h
COG1DBR_G1DBR4_MASK                      equ 0010h
COG1DBR_G1DBR5_POSN                      equ 0005h
COG1DBR_G1DBR5_POSITION                  equ 0005h
COG1DBR_G1DBR5_SIZE                      equ 0001h
COG1DBR_G1DBR5_LENGTH                    equ 0001h
COG1DBR_G1DBR5_MASK                      equ 0020h

// Register: COG1DBF
#define COG1DBF COG1DBF
COG1DBF                                  equ 0696h
// bitfield definitions
COG1DBF_G1DBF_POSN                       equ 0000h
COG1DBF_G1DBF_POSITION                   equ 0000h
COG1DBF_G1DBF_SIZE                       equ 0006h
COG1DBF_G1DBF_LENGTH                     equ 0006h
COG1DBF_G1DBF_MASK                       equ 003Fh
COG1DBF_G1DBF0_POSN                      equ 0000h
COG1DBF_G1DBF0_POSITION                  equ 0000h
COG1DBF_G1DBF0_SIZE                      equ 0001h
COG1DBF_G1DBF0_LENGTH                    equ 0001h
COG1DBF_G1DBF0_MASK                      equ 0001h
COG1DBF_G1DBF1_POSN                      equ 0001h
COG1DBF_G1DBF1_POSITION                  equ 0001h
COG1DBF_G1DBF1_SIZE                      equ 0001h
COG1DBF_G1DBF1_LENGTH                    equ 0001h
COG1DBF_G1DBF1_MASK                      equ 0002h
COG1DBF_G1DBF2_POSN                      equ 0002h
COG1DBF_G1DBF2_POSITION                  equ 0002h
COG1DBF_G1DBF2_SIZE                      equ 0001h
COG1DBF_G1DBF2_LENGTH                    equ 0001h
COG1DBF_G1DBF2_MASK                      equ 0004h
COG1DBF_G1DBF3_POSN                      equ 0003h
COG1DBF_G1DBF3_POSITION                  equ 0003h
COG1DBF_G1DBF3_SIZE                      equ 0001h
COG1DBF_G1DBF3_LENGTH                    equ 0001h
COG1DBF_G1DBF3_MASK                      equ 0008h
COG1DBF_G1DBF4_POSN                      equ 0004h
COG1DBF_G1DBF4_POSITION                  equ 0004h
COG1DBF_G1DBF4_SIZE                      equ 0001h
COG1DBF_G1DBF4_LENGTH                    equ 0001h
COG1DBF_G1DBF4_MASK                      equ 0010h
COG1DBF_G1DBF5_POSN                      equ 0005h
COG1DBF_G1DBF5_POSITION                  equ 0005h
COG1DBF_G1DBF5_SIZE                      equ 0001h
COG1DBF_G1DBF5_LENGTH                    equ 0001h
COG1DBF_G1DBF5_MASK                      equ 0020h

// Register: COG1CON0
#define COG1CON0 COG1CON0
COG1CON0                                 equ 0697h
// bitfield definitions
COG1CON0_G1MD_POSN                       equ 0000h
COG1CON0_G1MD_POSITION                   equ 0000h
COG1CON0_G1MD_SIZE                       equ 0003h
COG1CON0_G1MD_LENGTH                     equ 0003h
COG1CON0_G1MD_MASK                       equ 0007h
COG1CON0_G1CS_POSN                       equ 0003h
COG1CON0_G1CS_POSITION                   equ 0003h
COG1CON0_G1CS_SIZE                       equ 0002h
COG1CON0_G1CS_LENGTH                     equ 0002h
COG1CON0_G1CS_MASK                       equ 0018h
COG1CON0_G1LD_POSN                       equ 0006h
COG1CON0_G1LD_POSITION                   equ 0006h
COG1CON0_G1LD_SIZE                       equ 0001h
COG1CON0_G1LD_LENGTH                     equ 0001h
COG1CON0_G1LD_MASK                       equ 0040h
COG1CON0_G1EN_POSN                       equ 0007h
COG1CON0_G1EN_POSITION                   equ 0007h
COG1CON0_G1EN_SIZE                       equ 0001h
COG1CON0_G1EN_LENGTH                     equ 0001h
COG1CON0_G1EN_MASK                       equ 0080h
COG1CON0_G1MD0_POSN                      equ 0000h
COG1CON0_G1MD0_POSITION                  equ 0000h
COG1CON0_G1MD0_SIZE                      equ 0001h
COG1CON0_G1MD0_LENGTH                    equ 0001h
COG1CON0_G1MD0_MASK                      equ 0001h
COG1CON0_G1MD1_POSN                      equ 0001h
COG1CON0_G1MD1_POSITION                  equ 0001h
COG1CON0_G1MD1_SIZE                      equ 0001h
COG1CON0_G1MD1_LENGTH                    equ 0001h
COG1CON0_G1MD1_MASK                      equ 0002h
COG1CON0_G1MD2_POSN                      equ 0002h
COG1CON0_G1MD2_POSITION                  equ 0002h
COG1CON0_G1MD2_SIZE                      equ 0001h
COG1CON0_G1MD2_LENGTH                    equ 0001h
COG1CON0_G1MD2_MASK                      equ 0004h
COG1CON0_G1CS0_POSN                      equ 0003h
COG1CON0_G1CS0_POSITION                  equ 0003h
COG1CON0_G1CS0_SIZE                      equ 0001h
COG1CON0_G1CS0_LENGTH                    equ 0001h
COG1CON0_G1CS0_MASK                      equ 0008h
COG1CON0_G1CS1_POSN                      equ 0004h
COG1CON0_G1CS1_POSITION                  equ 0004h
COG1CON0_G1CS1_SIZE                      equ 0001h
COG1CON0_G1CS1_LENGTH                    equ 0001h
COG1CON0_G1CS1_MASK                      equ 0010h

// Register: COG1CON1
#define COG1CON1 COG1CON1
COG1CON1                                 equ 0698h
// bitfield definitions
COG1CON1_G1POLA_POSN                     equ 0000h
COG1CON1_G1POLA_POSITION                 equ 0000h
COG1CON1_G1POLA_SIZE                     equ 0001h
COG1CON1_G1POLA_LENGTH                   equ 0001h
COG1CON1_G1POLA_MASK                     equ 0001h
COG1CON1_G1POLB_POSN                     equ 0001h
COG1CON1_G1POLB_POSITION                 equ 0001h
COG1CON1_G1POLB_SIZE                     equ 0001h
COG1CON1_G1POLB_LENGTH                   equ 0001h
COG1CON1_G1POLB_MASK                     equ 0002h
COG1CON1_G1POLC_POSN                     equ 0002h
COG1CON1_G1POLC_POSITION                 equ 0002h
COG1CON1_G1POLC_SIZE                     equ 0001h
COG1CON1_G1POLC_LENGTH                   equ 0001h
COG1CON1_G1POLC_MASK                     equ 0004h
COG1CON1_G1POLD_POSN                     equ 0003h
COG1CON1_G1POLD_POSITION                 equ 0003h
COG1CON1_G1POLD_SIZE                     equ 0001h
COG1CON1_G1POLD_LENGTH                   equ 0001h
COG1CON1_G1POLD_MASK                     equ 0008h
COG1CON1_G1FDBS_POSN                     equ 0006h
COG1CON1_G1FDBS_POSITION                 equ 0006h
COG1CON1_G1FDBS_SIZE                     equ 0001h
COG1CON1_G1FDBS_LENGTH                   equ 0001h
COG1CON1_G1FDBS_MASK                     equ 0040h
COG1CON1_G1RDBS_POSN                     equ 0007h
COG1CON1_G1RDBS_POSITION                 equ 0007h
COG1CON1_G1RDBS_SIZE                     equ 0001h
COG1CON1_G1RDBS_LENGTH                   equ 0001h
COG1CON1_G1RDBS_MASK                     equ 0080h

// Register: COG1RIS
#define COG1RIS COG1RIS
COG1RIS                                  equ 0699h
// bitfield definitions
COG1RIS_G1RIS0_POSN                      equ 0000h
COG1RIS_G1RIS0_POSITION                  equ 0000h
COG1RIS_G1RIS0_SIZE                      equ 0001h
COG1RIS_G1RIS0_LENGTH                    equ 0001h
COG1RIS_G1RIS0_MASK                      equ 0001h
COG1RIS_G1RIS1_POSN                      equ 0001h
COG1RIS_G1RIS1_POSITION                  equ 0001h
COG1RIS_G1RIS1_SIZE                      equ 0001h
COG1RIS_G1RIS1_LENGTH                    equ 0001h
COG1RIS_G1RIS1_MASK                      equ 0002h
COG1RIS_G1RIS2_POSN                      equ 0002h
COG1RIS_G1RIS2_POSITION                  equ 0002h
COG1RIS_G1RIS2_SIZE                      equ 0001h
COG1RIS_G1RIS2_LENGTH                    equ 0001h
COG1RIS_G1RIS2_MASK                      equ 0004h
COG1RIS_G1RIS3_POSN                      equ 0003h
COG1RIS_G1RIS3_POSITION                  equ 0003h
COG1RIS_G1RIS3_SIZE                      equ 0001h
COG1RIS_G1RIS3_LENGTH                    equ 0001h
COG1RIS_G1RIS3_MASK                      equ 0008h
COG1RIS_G1RIS4_POSN                      equ 0004h
COG1RIS_G1RIS4_POSITION                  equ 0004h
COG1RIS_G1RIS4_SIZE                      equ 0001h
COG1RIS_G1RIS4_LENGTH                    equ 0001h
COG1RIS_G1RIS4_MASK                      equ 0010h
COG1RIS_G1RIS5_POSN                      equ 0005h
COG1RIS_G1RIS5_POSITION                  equ 0005h
COG1RIS_G1RIS5_SIZE                      equ 0001h
COG1RIS_G1RIS5_LENGTH                    equ 0001h
COG1RIS_G1RIS5_MASK                      equ 0020h
COG1RIS_G1RIS6_POSN                      equ 0006h
COG1RIS_G1RIS6_POSITION                  equ 0006h
COG1RIS_G1RIS6_SIZE                      equ 0001h
COG1RIS_G1RIS6_LENGTH                    equ 0001h
COG1RIS_G1RIS6_MASK                      equ 0040h

// Register: COG1RSIM
#define COG1RSIM COG1RSIM
COG1RSIM                                 equ 069Ah
// bitfield definitions
COG1RSIM_G1RSIM0_POSN                    equ 0000h
COG1RSIM_G1RSIM0_POSITION                equ 0000h
COG1RSIM_G1RSIM0_SIZE                    equ 0001h
COG1RSIM_G1RSIM0_LENGTH                  equ 0001h
COG1RSIM_G1RSIM0_MASK                    equ 0001h
COG1RSIM_G1RSIM1_POSN                    equ 0001h
COG1RSIM_G1RSIM1_POSITION                equ 0001h
COG1RSIM_G1RSIM1_SIZE                    equ 0001h
COG1RSIM_G1RSIM1_LENGTH                  equ 0001h
COG1RSIM_G1RSIM1_MASK                    equ 0002h
COG1RSIM_G1RSIM2_POSN                    equ 0002h
COG1RSIM_G1RSIM2_POSITION                equ 0002h
COG1RSIM_G1RSIM2_SIZE                    equ 0001h
COG1RSIM_G1RSIM2_LENGTH                  equ 0001h
COG1RSIM_G1RSIM2_MASK                    equ 0004h
COG1RSIM_G1RSIM3_POSN                    equ 0003h
COG1RSIM_G1RSIM3_POSITION                equ 0003h
COG1RSIM_G1RSIM3_SIZE                    equ 0001h
COG1RSIM_G1RSIM3_LENGTH                  equ 0001h
COG1RSIM_G1RSIM3_MASK                    equ 0008h
COG1RSIM_G1RSIM4_POSN                    equ 0004h
COG1RSIM_G1RSIM4_POSITION                equ 0004h
COG1RSIM_G1RSIM4_SIZE                    equ 0001h
COG1RSIM_G1RSIM4_LENGTH                  equ 0001h
COG1RSIM_G1RSIM4_MASK                    equ 0010h
COG1RSIM_G1RSIM5_POSN                    equ 0005h
COG1RSIM_G1RSIM5_POSITION                equ 0005h
COG1RSIM_G1RSIM5_SIZE                    equ 0001h
COG1RSIM_G1RSIM5_LENGTH                  equ 0001h
COG1RSIM_G1RSIM5_MASK                    equ 0020h
COG1RSIM_G1RSIM6_POSN                    equ 0006h
COG1RSIM_G1RSIM6_POSITION                equ 0006h
COG1RSIM_G1RSIM6_SIZE                    equ 0001h
COG1RSIM_G1RSIM6_LENGTH                  equ 0001h
COG1RSIM_G1RSIM6_MASK                    equ 0040h

// Register: COG1FIS
#define COG1FIS COG1FIS
COG1FIS                                  equ 069Bh
// bitfield definitions
COG1FIS_G1FIS0_POSN                      equ 0000h
COG1FIS_G1FIS0_POSITION                  equ 0000h
COG1FIS_G1FIS0_SIZE                      equ 0001h
COG1FIS_G1FIS0_LENGTH                    equ 0001h
COG1FIS_G1FIS0_MASK                      equ 0001h
COG1FIS_G1FIS1_POSN                      equ 0001h
COG1FIS_G1FIS1_POSITION                  equ 0001h
COG1FIS_G1FIS1_SIZE                      equ 0001h
COG1FIS_G1FIS1_LENGTH                    equ 0001h
COG1FIS_G1FIS1_MASK                      equ 0002h
COG1FIS_G1FIS2_POSN                      equ 0002h
COG1FIS_G1FIS2_POSITION                  equ 0002h
COG1FIS_G1FIS2_SIZE                      equ 0001h
COG1FIS_G1FIS2_LENGTH                    equ 0001h
COG1FIS_G1FIS2_MASK                      equ 0004h
COG1FIS_G1FIS3_POSN                      equ 0003h
COG1FIS_G1FIS3_POSITION                  equ 0003h
COG1FIS_G1FIS3_SIZE                      equ 0001h
COG1FIS_G1FIS3_LENGTH                    equ 0001h
COG1FIS_G1FIS3_MASK                      equ 0008h
COG1FIS_G1FIS4_POSN                      equ 0004h
COG1FIS_G1FIS4_POSITION                  equ 0004h
COG1FIS_G1FIS4_SIZE                      equ 0001h
COG1FIS_G1FIS4_LENGTH                    equ 0001h
COG1FIS_G1FIS4_MASK                      equ 0010h
COG1FIS_G1FIS5_POSN                      equ 0005h
COG1FIS_G1FIS5_POSITION                  equ 0005h
COG1FIS_G1FIS5_SIZE                      equ 0001h
COG1FIS_G1FIS5_LENGTH                    equ 0001h
COG1FIS_G1FIS5_MASK                      equ 0020h
COG1FIS_G1FIS6_POSN                      equ 0006h
COG1FIS_G1FIS6_POSITION                  equ 0006h
COG1FIS_G1FIS6_SIZE                      equ 0001h
COG1FIS_G1FIS6_LENGTH                    equ 0001h
COG1FIS_G1FIS6_MASK                      equ 0040h

// Register: COG1FSIM
#define COG1FSIM COG1FSIM
COG1FSIM                                 equ 069Ch
// bitfield definitions
COG1FSIM_G1FSIM0_POSN                    equ 0000h
COG1FSIM_G1FSIM0_POSITION                equ 0000h
COG1FSIM_G1FSIM0_SIZE                    equ 0001h
COG1FSIM_G1FSIM0_LENGTH                  equ 0001h
COG1FSIM_G1FSIM0_MASK                    equ 0001h
COG1FSIM_G1FSIM1_POSN                    equ 0001h
COG1FSIM_G1FSIM1_POSITION                equ 0001h
COG1FSIM_G1FSIM1_SIZE                    equ 0001h
COG1FSIM_G1FSIM1_LENGTH                  equ 0001h
COG1FSIM_G1FSIM1_MASK                    equ 0002h
COG1FSIM_G1FSIM2_POSN                    equ 0002h
COG1FSIM_G1FSIM2_POSITION                equ 0002h
COG1FSIM_G1FSIM2_SIZE                    equ 0001h
COG1FSIM_G1FSIM2_LENGTH                  equ 0001h
COG1FSIM_G1FSIM2_MASK                    equ 0004h
COG1FSIM_G1FSIM3_POSN                    equ 0003h
COG1FSIM_G1FSIM3_POSITION                equ 0003h
COG1FSIM_G1FSIM3_SIZE                    equ 0001h
COG1FSIM_G1FSIM3_LENGTH                  equ 0001h
COG1FSIM_G1FSIM3_MASK                    equ 0008h
COG1FSIM_G1FSIM4_POSN                    equ 0004h
COG1FSIM_G1FSIM4_POSITION                equ 0004h
COG1FSIM_G1FSIM4_SIZE                    equ 0001h
COG1FSIM_G1FSIM4_LENGTH                  equ 0001h
COG1FSIM_G1FSIM4_MASK                    equ 0010h
COG1FSIM_G1FSIM5_POSN                    equ 0005h
COG1FSIM_G1FSIM5_POSITION                equ 0005h
COG1FSIM_G1FSIM5_SIZE                    equ 0001h
COG1FSIM_G1FSIM5_LENGTH                  equ 0001h
COG1FSIM_G1FSIM5_MASK                    equ 0020h
COG1FSIM_G1FSIM6_POSN                    equ 0006h
COG1FSIM_G1FSIM6_POSITION                equ 0006h
COG1FSIM_G1FSIM6_SIZE                    equ 0001h
COG1FSIM_G1FSIM6_LENGTH                  equ 0001h
COG1FSIM_G1FSIM6_MASK                    equ 0040h

